khttang/esp32-biometric-system/firmware/sdkconfig.defaults
# =============================================================================
# 1. Core Operating System & Task Stacks (Your Existing Controls)
# =============================================================================
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096

# =============================================================================
# 2. ESP32-P4 Hardware & Target Directives
# =============================================================================
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y

# =============================================================================
# 3. External RAM (PSRAM / SPIRAM) Configuration - MANDATORY FOR BIOMETRICS
# =============================================================================
# Enables the external RAM hardware interface
CONFIG_SPIRAM=y

# Forces the system to initialize PSRAM during the early stage boot loop
CONFIG_SPIRAM_BOOT_INIT=y

# Standard high-speed clock timing for the ESP32-P4 PSRAM interface (200MHz)
CONFIG_SPIRAM_SPEED_200M=y

# Sets how memory allocations handle PSRAM. 
# "Make alloc prefer external" ensures large neural network arrays default to PSRAM,
# saving the precious internal SRAM for your fast C wrappers and Rust code.
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# =============================================================================
# 4. Config partitions for OTA updates
# =============================================================================
# Configure Flash Size to 16MB (Matches Waveshare ESP32-P4)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_OFFSET=0xc000

# =============================================================================
# 5. Processor Instruction Extensions (PIE) & Cache (ESP-DL Speed Boost)
# =============================================================================
# Maximize L2 Cache size to handle fast INT8 weight streaming
CONFIG_CACHE_L2_CACHE_128KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# =============================================================================
# 6. Framework Specific Acceleration (ESP-DL & ESP-WHO)
# =============================================================================
# Instructs ESP-DL to leverage both RISC-V cores natively for execution pipelines
CONFIG_ESP_DL_MULTICORE=y

# Enables the general ESP-DL inference engine hooks
CONFIG_ESP_DL_SUPPORT=y
CONFIG_ESP_WHO_SUPPORT=y

# Internal EMAC Ethernet Configuration
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_RMII_CLK_INPUT=y

# Dynamic Frequency Scaling & Power Management
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=n
CONFIG_PM_PROFILING=n

CONFIG_ESP_CAM_CTLR_CSI_ENABLE=y
CONFIG_ESP_PA_CSI_ENABLE=y

CONFIG_ESP_DRIVER_ISP_ENABLE=y
CONFIG_ESP_DRIVER_CAM_CSI_ENABLE=y
CONFIG_ESP_DRIVER_CAM_ENABLE=y

CONFIG_LCD_ENABLE_MIPI_DSI_PANEL=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y
CONFIG_ETH_USE_ESP32P4_EMAC=y